test_scripts/output_20200404_150436.log
2020-04-04 15:04:36,417 - run_test - INFO - Prerequisites satisfied
2020-04-04 15:04:36,417 - run_test - INFO - Estimated duration: 0.24000000000000002 hours
2020-04-04 15:04:36,417 - run_test - INFO - Using logfile: results_20200404_150436.log
2020-04-04 15:04:36,418 - run_test - INFO - Processing command: /usr/lib/jvm/java-11-openjdk-amd64/bin/java -jar sb_jpa_hikari_jdbc-0.0.1-SNAPSHOT.jar
2020-04-04 15:04:36,418 - run_test - INFO - Number of CPUs for load generation 4
2020-04-04 15:04:36,418 - run_test - INFO - Number of CPUs for service 4
2020-04-04 15:04:36,418 - run_test - INFO - Number of concurrent requests 4
2020-04-04 15:04:46,456 - run_test - INFO - Java process PID is: 3917
2020-04-04 15:04:46,457 - run_test - INFO - Executing test with concurrency: 4 and duration 1 and threads 4
2020-04-04 15:04:47,561 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c4 -t4 http://localhost:8080/people
2020-04-04 15:04:47,561 - run_test - INFO - Executing test done
2020-04-04 15:04:48,562 - run_test - INFO - Executing test with concurrency: 4 and duration 60 and threads 4
2020-04-04 15:05:48,670 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c4 -t4 http://localhost:8080/people
2020-04-04 15:05:48,670 - run_test - INFO - Executing test done
2020-04-04 15:05:48,670 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk output:   4 threads and 4 connections
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk output:     Latency   376.70us  655.77us  21.57ms   96.59%
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk output:     Req/Sec     3.27k     0.85k    4.67k    85.88%
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk output:   781873 requests in 1.00m, 475.87MB read
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk output: Requests/sec:  13009.64
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk output: Transfer/sec:      7.92MB
2020-04-04 15:05:48,672 - run_test - DEBUG - wrk_output: {'lat_avg': 0.3767, 'lat_stdev': 0.65577, 'lat_max': 21.57, 'req_avg': 3270.0, 'req_stdev': 850.0, 'req_max': 4670.0, 'tot_requests': 781873.0, 'tot_duration': 60000.0, 'read': 498985861.12, 'req_sec_tot': 13009.64, 'read_tot': 8304721.92, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:05:48,701 - run_test - INFO - CPU and memory: ,11675,4792,0,0,833308,833385,837300
2020-04-04 15:05:48,701 - run_test - INFO - Killing process with PID: 3917
2020-04-04 15:05:48,728 - run_test - INFO - Number of concurrent requests 100
2020-04-04 15:05:58,770 - run_test - INFO - Java process PID is: 4121
2020-04-04 15:05:58,770 - run_test - INFO - Executing test with concurrency: 100 and duration 1 and threads 4
2020-04-04 15:05:59,823 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c100 -t4 http://localhost:8080/people
2020-04-04 15:05:59,823 - run_test - INFO - Executing test done
2020-04-04 15:06:00,825 - run_test - INFO - Executing test with concurrency: 100 and duration 60 and threads 4
2020-04-04 15:07:00,885 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c100 -t4 http://localhost:8080/people
2020-04-04 15:07:00,885 - run_test - INFO - Executing test done
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output:   4 threads and 100 connections
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output:     Latency    16.80ms   31.97ms 791.20ms   92.83%
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output:     Req/Sec     2.76k     1.22k    5.74k    60.38%
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output:   660147 requests in 1.00m, 401.78MB read
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output: Requests/sec:  10993.89
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk output: Transfer/sec:      6.69MB
2020-04-04 15:07:00,885 - run_test - DEBUG - wrk_output: {'lat_avg': 16.8, 'lat_stdev': 31.97, 'lat_max': 791.2, 'req_avg': 2760.0, 'req_stdev': 1220.0, 'req_max': 5740.0, 'tot_requests': 660147.0, 'tot_duration': 60000.0, 'read': 421296865.28, 'req_sec_tot': 10993.89, 'read_tot': 7014973.44, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:07:00,916 - run_test - INFO - CPU and memory: ,20968,4219,0,0,771700,771778,775684
2020-04-04 15:07:00,916 - run_test - INFO - Killing process with PID: 4121
2020-04-04 15:07:00,942 - run_test - INFO - Number of concurrent requests 200
2020-04-04 15:07:10,983 - run_test - INFO - Java process PID is: 4471
2020-04-04 15:07:10,984 - run_test - INFO - Executing test with concurrency: 200 and duration 1 and threads 4
2020-04-04 15:07:12,031 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c200 -t4 http://localhost:8080/people
2020-04-04 15:07:12,031 - run_test - INFO - Executing test done
2020-04-04 15:07:13,032 - run_test - INFO - Executing test with concurrency: 200 and duration 60 and threads 4
2020-04-04 15:08:13,134 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c200 -t4 http://localhost:8080/people
2020-04-04 15:08:13,134 - run_test - INFO - Executing test done
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output:   4 threads and 200 connections
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output:     Latency    37.02ms   62.94ms   1.38s    90.39%
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output:     Req/Sec     2.66k     1.46k    5.76k    59.79%
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output:   635365 requests in 1.00m, 386.70MB read
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output: Requests/sec:  10574.63
2020-04-04 15:08:13,134 - run_test - DEBUG - wrk output: Transfer/sec:      6.44MB
2020-04-04 15:08:13,135 - run_test - DEBUG - wrk_output: {'lat_avg': 37.02, 'lat_stdev': 62.94, 'lat_max': 1380.0, 'req_avg': 2660.0, 'req_stdev': 1460.0, 'req_max': 5760.0, 'tot_requests': 635365.0, 'tot_duration': 60000.0, 'read': 405484339.2, 'req_sec_tot': 10574.63, 'read_tot': 6752829.44, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:08:13,170 - run_test - INFO - CPU and memory: ,20868,4303,0,0,851664,851743,855652
2020-04-04 15:08:13,170 - run_test - INFO - Killing process with PID: 4471
2020-04-04 15:08:13,199 - run_test - INFO - Processing command: /usr/lib/jvm/java-11-openjdk-amd64/bin/java -jar sb_webflux_r2dbcpool_r2dbc-0.0.1-SNAPSHOT.jar
2020-04-04 15:08:13,199 - run_test - INFO - Number of CPUs for load generation 4
2020-04-04 15:08:13,199 - run_test - INFO - Number of CPUs for service 4
2020-04-04 15:08:13,199 - run_test - INFO - Number of concurrent requests 4
2020-04-04 15:08:23,239 - run_test - INFO - Java process PID is: 4878
2020-04-04 15:08:23,239 - run_test - INFO - Executing test with concurrency: 4 and duration 1 and threads 4
2020-04-04 15:08:24,343 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c4 -t4 http://localhost:8080/people
2020-04-04 15:08:24,343 - run_test - INFO - Executing test done
2020-04-04 15:08:25,344 - run_test - INFO - Executing test with concurrency: 4 and duration 60 and threads 4
2020-04-04 15:09:25,451 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c4 -t4 http://localhost:8080/people
2020-04-04 15:09:25,451 - run_test - INFO - Executing test done
2020-04-04 15:09:25,451 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:09:25,451 - run_test - DEBUG - wrk output:   4 threads and 4 connections
2020-04-04 15:09:25,451 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:09:25,452 - run_test - DEBUG - wrk output:     Latency   408.56us  692.68us  23.69ms   97.78%
2020-04-04 15:09:25,452 - run_test - DEBUG - wrk output:     Req/Sec     2.95k   604.65     3.92k    88.71%
2020-04-04 15:09:25,452 - run_test - DEBUG - wrk output:   703791 requests in 1.00m, 404.73MB read
2020-04-04 15:09:25,452 - run_test - DEBUG - wrk output: Requests/sec:  11710.50
2020-04-04 15:09:25,452 - run_test - DEBUG - wrk output: Transfer/sec:      6.73MB
2020-04-04 15:09:25,452 - run_test - DEBUG - wrk_output: {'lat_avg': 0.40856, 'lat_stdev': 0.69268, 'lat_max': 23.69, 'req_avg': 2950.0, 'req_stdev': 604.65, 'req_max': 3920.0, 'tot_requests': 703791.0, 'tot_duration': 60000.0, 'read': 424390164.48, 'req_sec_tot': 11710.5, 'read_tot': 7056916.48, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:09:25,479 - run_test - INFO - CPU and memory: ,14827,3422,0,0,756452,756531,760476
2020-04-04 15:09:25,480 - run_test - INFO - Killing process with PID: 4878
2020-04-04 15:09:25,504 - run_test - INFO - Number of concurrent requests 100
2020-04-04 15:09:35,541 - run_test - INFO - Java process PID is: 4961
2020-04-04 15:09:35,542 - run_test - INFO - Executing test with concurrency: 100 and duration 1 and threads 4
2020-04-04 15:09:36,574 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c100 -t4 http://localhost:8080/people
2020-04-04 15:09:36,574 - run_test - INFO - Executing test done
2020-04-04 15:09:37,575 - run_test - INFO - Executing test with concurrency: 100 and duration 60 and threads 4
2020-04-04 15:10:37,624 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c100 -t4 http://localhost:8080/people
2020-04-04 15:10:37,624 - run_test - INFO - Executing test done
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output:   4 threads and 100 connections
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output:     Latency     9.39ms   22.63ms 533.35ms   97.36%
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output:     Req/Sec     4.08k     1.10k    5.27k    83.83%
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output:   975104 requests in 1.00m, 560.75MB read
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output: Requests/sec:  16242.12
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk output: Transfer/sec:      9.34MB
2020-04-04 15:10:37,638 - run_test - DEBUG - wrk_output: {'lat_avg': 9.39, 'lat_stdev': 22.63, 'lat_max': 533.35, 'req_avg': 4080.0, 'req_stdev': 1100.0, 'req_max': 5270.0, 'tot_requests': 975104.0, 'tot_duration': 60000.0, 'read': 587988992.0, 'req_sec_tot': 16242.12, 'read_tot': 9793699.84, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:10:37,669 - run_test - INFO - CPU and memory: ,20523,3873,0,0,808316,808392,812332
2020-04-04 15:10:37,669 - run_test - INFO - Killing process with PID: 4961
2020-04-04 15:10:37,696 - run_test - INFO - Number of concurrent requests 200
2020-04-04 15:10:47,735 - run_test - INFO - Java process PID is: 5139
2020-04-04 15:10:47,735 - run_test - INFO - Executing test with concurrency: 200 and duration 1 and threads 4
2020-04-04 15:10:48,795 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c200 -t4 http://localhost:8080/people
2020-04-04 15:10:48,795 - run_test - INFO - Executing test done
2020-04-04 15:10:49,796 - run_test - INFO - Executing test with concurrency: 200 and duration 60 and threads 4
2020-04-04 15:11:49,885 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c200 -t4 http://localhost:8080/people
2020-04-04 15:11:49,886 - run_test - INFO - Executing test done
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output:   4 threads and 200 connections
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output:     Latency    16.56ms   48.73ms   1.01s    97.80%
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output:     Req/Sec     4.28k     1.18k    5.63k    83.08%
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output:   1021443 requests in 1.00m, 587.40MB read
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output:   Non-2xx or 3xx responses: 2
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output: Requests/sec:  17003.07
2020-04-04 15:11:49,886 - run_test - DEBUG - wrk output: Transfer/sec:      9.78MB
2020-04-04 15:11:49,887 - run_test - DEBUG - wrk_output: {'lat_avg': 16.56, 'lat_stdev': 48.73, 'lat_max': 1010.0, 'req_avg': 4280.0, 'req_stdev': 1180.0, 'req_max': 5630.0, 'tot_requests': 1021443.0, 'tot_duration': 60000.0, 'read': 615933542.4, 'req_sec_tot': 17003.07, 'read_tot': 10255073.28, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:11:49,920 - run_test - INFO - CPU and memory: ,20203,4022,0,0,850496,850573,854480
2020-04-04 15:11:49,920 - run_test - INFO - Killing process with PID: 5139
2020-04-04 15:11:49,947 - run_test - INFO - Processing command: /usr/lib/jvm/java-11-openjdk-amd64/bin/java -jar sb_jpa_r2dbcpool_r2dbc-0.0.1-SNAPSHOT.jar
2020-04-04 15:11:49,948 - run_test - INFO - Number of CPUs for load generation 4
2020-04-04 15:11:49,948 - run_test - INFO - Number of CPUs for service 4
2020-04-04 15:11:49,948 - run_test - INFO - Number of concurrent requests 4
2020-04-04 15:11:59,988 - run_test - INFO - Java process PID is: 5407
2020-04-04 15:11:59,988 - run_test - INFO - Executing test with concurrency: 4 and duration 1 and threads 4
2020-04-04 15:12:00,992 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c4 -t4 http://localhost:8080/people
2020-04-04 15:12:00,992 - run_test - INFO - Executing test done
2020-04-04 15:12:01,994 - run_test - INFO - Executing test with concurrency: 4 and duration 60 and threads 4
2020-04-04 15:13:02,102 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c4 -t4 http://localhost:8080/people
2020-04-04 15:13:02,102 - run_test - INFO - Executing test done
2020-04-04 15:13:02,102 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:13:02,102 - run_test - DEBUG - wrk output:   4 threads and 4 connections
2020-04-04 15:13:02,103 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:13:02,103 - run_test - DEBUG - wrk output:     Latency   416.43us  700.35us  26.69ms   97.50%
2020-04-04 15:13:02,103 - run_test - DEBUG - wrk output:     Req/Sec     2.90k   684.95     3.99k    86.14%
2020-04-04 15:13:02,103 - run_test - DEBUG - wrk output:   693293 requests in 1.00m, 421.96MB read
2020-04-04 15:13:02,103 - run_test - DEBUG - wrk output: Requests/sec:  11535.65
2020-04-04 15:13:02,103 - run_test - DEBUG - wrk output: Transfer/sec:      7.02MB
2020-04-04 15:13:02,103 - run_test - DEBUG - wrk_output: {'lat_avg': 0.41643, 'lat_stdev': 0.70035, 'lat_max': 26.69, 'req_avg': 2900.0, 'req_stdev': 684.95, 'req_max': 3990.0, 'tot_requests': 693293.0, 'tot_duration': 60000.0, 'read': 442457128.96, 'req_sec_tot': 11535.65, 'read_tot': 7361003.52, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:13:02,134 - run_test - INFO - CPU and memory: ,14449,4297,0,0,784908,784987,788892
2020-04-04 15:13:02,134 - run_test - INFO - Killing process with PID: 5407
2020-04-04 15:13:02,159 - run_test - INFO - Number of concurrent requests 100
2020-04-04 15:13:12,196 - run_test - INFO - Java process PID is: 5514
2020-04-04 15:13:12,196 - run_test - INFO - Executing test with concurrency: 100 and duration 1 and threads 4
2020-04-04 15:13:13,222 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c100 -t4 http://localhost:8080/people
2020-04-04 15:13:13,223 - run_test - INFO - Executing test done
2020-04-04 15:13:14,224 - run_test - INFO - Executing test with concurrency: 100 and duration 60 and threads 4
2020-04-04 15:14:14,255 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c100 -t4 http://localhost:8080/people
2020-04-04 15:14:14,255 - run_test - INFO - Executing test done
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output:   4 threads and 100 connections
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output:     Latency     5.66ms    5.33ms 152.75ms   93.65%
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output:     Req/Sec     3.73k     1.11k    5.02k    75.62%
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output:   891347 requests in 1.00m, 542.50MB read
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output:   Non-2xx or 3xx responses: 6
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output: Requests/sec:  14850.53
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk output: Transfer/sec:      9.04MB
2020-04-04 15:14:14,256 - run_test - DEBUG - wrk_output: {'lat_avg': 5.66, 'lat_stdev': 5.33, 'lat_max': 152.75, 'req_avg': 3730.0, 'req_stdev': 1110.0, 'req_max': 5020.0, 'tot_requests': 891347.0, 'tot_duration': 60000.0, 'read': 568852480.0, 'req_sec_tot': 14850.53, 'read_tot': 9479127.04, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:14:14,290 - run_test - INFO - CPU and memory: ,19106,5192,0,0,908196,908273,912172
2020-04-04 15:14:14,290 - run_test - INFO - Killing process with PID: 5514
2020-04-04 15:14:14,320 - run_test - INFO - Number of concurrent requests 200
2020-04-04 15:14:24,360 - run_test - INFO - Java process PID is: 6009
2020-04-04 15:14:24,360 - run_test - INFO - Executing test with concurrency: 200 and duration 1 and threads 4
2020-04-04 15:14:25,440 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c200 -t4 http://localhost:8080/people
2020-04-04 15:14:25,440 - run_test - INFO - Executing test done
2020-04-04 15:14:26,441 - run_test - INFO - Executing test with concurrency: 200 and duration 60 and threads 4
2020-04-04 15:15:26,502 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c200 -t4 http://localhost:8080/people
2020-04-04 15:15:26,503 - run_test - INFO - Executing test done
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output:   4 threads and 200 connections
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output:     Latency    12.99ms   10.15ms 512.79ms   93.01%
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output:     Req/Sec     3.70k     0.99k    5.20k    77.03%
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output:   884113 requests in 1.00m, 538.09MB read
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output: Requests/sec:  14723.82
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk output: Transfer/sec:      8.96MB
2020-04-04 15:15:26,503 - run_test - DEBUG - wrk_output: {'lat_avg': 12.99, 'lat_stdev': 10.15, 'lat_max': 512.79, 'req_avg': 3700.0, 'req_stdev': 990.0, 'req_max': 5200.0, 'tot_requests': 884113.0, 'tot_duration': 60000.0, 'read': 564228259.84, 'req_sec_tot': 14723.82, 'read_tot': 9395240.96, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:15:26,542 - run_test - INFO - CPU and memory: ,19398,5182,0,0,924464,924548,928480
2020-04-04 15:15:26,542 - run_test - INFO - Killing process with PID: 6009
2020-04-04 15:15:26,573 - run_test - INFO - Processing command: /usr/lib/jvm/java-11-openjdk-amd64/bin/java -jar sb_webflux_jpa_hikari_jdbc-0.0.1-SNAPSHOT.jar
2020-04-04 15:15:26,573 - run_test - INFO - Number of CPUs for load generation 4
2020-04-04 15:15:26,573 - run_test - INFO - Number of CPUs for service 4
2020-04-04 15:15:26,573 - run_test - INFO - Number of concurrent requests 4
2020-04-04 15:15:36,615 - run_test - INFO - Java process PID is: 6728
2020-04-04 15:15:36,615 - run_test - INFO - Executing test with concurrency: 4 and duration 1 and threads 4
2020-04-04 15:15:37,719 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c4 -t4 http://localhost:8080/people
2020-04-04 15:15:37,719 - run_test - INFO - Executing test done
2020-04-04 15:15:38,721 - run_test - INFO - Executing test with concurrency: 4 and duration 60 and threads 4
2020-04-04 15:16:38,737 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c4 -t4 http://localhost:8080/people
2020-04-04 15:16:38,737 - run_test - INFO - Executing test done
2020-04-04 15:16:38,737 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:16:38,737 - run_test - DEBUG - wrk output:   4 threads and 4 connections
2020-04-04 15:16:38,738 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:16:38,738 - run_test - DEBUG - wrk output:     Latency   601.26us  625.64us  24.13ms   93.65%
2020-04-04 15:16:38,738 - run_test - DEBUG - wrk output:     Req/Sec     1.91k   601.06     2.33k    81.08%
2020-04-04 15:16:38,738 - run_test - DEBUG - wrk output:   456174 requests in 1.00m, 262.33MB read
2020-04-04 15:16:38,738 - run_test - DEBUG - wrk output: Requests/sec:   7602.04
2020-04-04 15:16:38,738 - run_test - DEBUG - wrk output: Transfer/sec:      4.37MB
2020-04-04 15:16:38,739 - run_test - DEBUG - wrk_output: {'lat_avg': 0.60126, 'lat_stdev': 0.62564, 'lat_max': 24.13, 'req_avg': 1910.0, 'req_stdev': 601.06, 'req_max': 2330.0, 'tot_requests': 456174.0, 'tot_duration': 60000.0, 'read': 275072942.08, 'req_sec_tot': 7602.04, 'read_tot': 4582277.12, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:16:38,813 - run_test - INFO - CPU and memory: ,11264,3750,0,0,967788,967868,971848
2020-04-04 15:16:38,813 - run_test - INFO - Killing process with PID: 6728
2020-04-04 15:16:38,861 - run_test - INFO - Number of concurrent requests 100
2020-04-04 15:16:48,900 - run_test - INFO - Java process PID is: 6924
2020-04-04 15:16:48,900 - run_test - INFO - Executing test with concurrency: 100 and duration 1 and threads 4
2020-04-04 15:16:49,945 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c100 -t4 http://localhost:8080/people
2020-04-04 15:16:49,946 - run_test - INFO - Executing test done
2020-04-04 15:16:50,947 - run_test - INFO - Executing test with concurrency: 100 and duration 60 and threads 4
2020-04-04 15:17:50,990 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c100 -t4 http://localhost:8080/people
2020-04-04 15:17:50,990 - run_test - INFO - Executing test done
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output:   4 threads and 100 connections
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output:     Latency    10.23ms    8.01ms 207.28ms   93.49%
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output:     Req/Sec     2.65k   558.64     3.25k    80.96%
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output:   632685 requests in 1.00m, 363.84MB read
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output: Requests/sec:  10539.07
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk output: Transfer/sec:      6.06MB
2020-04-04 15:17:50,990 - run_test - DEBUG - wrk_output: {'lat_avg': 10.23, 'lat_stdev': 8.01, 'lat_max': 207.28, 'req_avg': 2650.0, 'req_stdev': 558.64, 'req_max': 3250.0, 'tot_requests': 632685.0, 'tot_duration': 60000.0, 'read': 381513891.84, 'req_sec_tot': 10539.07, 'read_tot': 6354370.56, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:17:51,027 - run_test - INFO - CPU and memory: ,15712,5276,0,0,970064,970378,974384
2020-04-04 15:17:51,027 - run_test - INFO - Killing process with PID: 6924
2020-04-04 15:17:51,058 - run_test - INFO - Number of concurrent requests 200
2020-04-04 15:18:01,099 - run_test - INFO - Java process PID is: 7152
2020-04-04 15:18:01,099 - run_test - INFO - Executing test with concurrency: 200 and duration 1 and threads 4
2020-04-04 15:18:02,162 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d1s -c200 -t4 http://localhost:8080/people
2020-04-04 15:18:02,163 - run_test - INFO - Executing test done
2020-04-04 15:18:03,164 - run_test - INFO - Executing test with concurrency: 200 and duration 60 and threads 4
2020-04-04 15:19:03,253 - run_test - DEBUG - Executing test command taskset -c 3,5,7,9 /home/maarten/projects/wrk/wrk --timeout 20s -d60s -c200 -t4 http://localhost:8080/people
2020-04-04 15:19:03,254 - run_test - INFO - Executing test done
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output: Running 1m test @ http://localhost:8080/people
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output:   4 threads and 200 connections
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output:   Thread Stats   Avg      Stdev     Max   +/- Stdev
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output:     Latency    20.66ms   11.14ms 240.01ms   88.60%
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output:     Req/Sec     2.53k   522.53     3.25k    81.21%
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output:   603981 requests in 1.00m, 347.33MB read
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output: Requests/sec:  10053.22
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk output: Transfer/sec:      5.78MB
2020-04-04 15:19:03,254 - run_test - DEBUG - wrk_output: {'lat_avg': 20.66, 'lat_stdev': 11.14, 'lat_max': 240.01, 'req_avg': 2530.0, 'req_stdev': 522.53, 'req_max': 3250.0, 'tot_requests': 603981.0, 'tot_duration': 60000.0, 'read': 364201902.08, 'req_sec_tot': 10053.22, 'read_tot': 6060769.28, 'err_connect': 0, 'err_read': 0, 'err_write': 0, 'err_timeout': 0}
2020-04-04 15:19:03,292 - run_test - INFO - CPU and memory: ,16192,5253,0,0,874592,874771,878896
2020-04-04 15:19:03,292 - run_test - INFO - Killing process with PID: 7152
2020-04-04 15:19:03,321 - run_test - INFO - Test execution finished